## Author: 
## Date: 
## CS301-006, Professor Watson
## HW06 Solution

The purpose of this assignment is to help students practice using Python to prepare their data sets for machine learning.

link to the git repo:

In [ ]:
#Vaishnavi Patel
#4/3/2020
#CS301-006 Prof Watson
#HW06
#Github link: https://github.com/vap38/CS301

In [0]:
import pandas as pd
import numpy as np

#### Question 1 - Read in the data set and print the % empty values for each column. Are there any columns with missing values?

In [0]:
data_dir = 'groundhog.csv'

In [3]:
df = pd.read_csv(data_dir)
df.head(10)

   Unnamed: 0  ...  March Average Temperature (Pennsylvania)
0           0  ...                                       NaN
1           1  ...                                       NaN
2           2  ...                                       NaN
3           3  ...                                       NaN
4           4  ...                                       NaN
5           5  ...                                       NaN
6           6  ...                                       NaN
7           7  ...                                       NaN
8           8  ...                                       NaN
9           9  ...                                      31.3

[10 rows x 11 columns]

In [4]:
(df.isnull().sum()/ df.shape[0]) * 100.00

Unnamed: 0                                     0.000000
Year                                           0.000000
Punxsutawney Phil                              0.000000
February Average Temperature                   6.870229
February Average Temperature (Northeast)       6.870229
February Average Temperature (Midwest)         6.870229
February Average Temperature (Pennsylvania)    6.870229
March Average Temperature                      6.870229
March Average Temperature (Northeast)          6.870229
March Average Temperature (Midwest)            6.870229
March Average Temperature (Pennsylvania)       6.870229
dtype: float64

There are 2 columns with no null values. <br>
1. Year <br>
2. Punxsutawney Phil

#### Question 2 - Create a new dataframe which is a copy of the orginal one. In this copy, replace the missing values in the data set using one of the discussed methods in class.

In [0]:
df_new = df

In [0]:
df_new = df_new.fillna(df_new.mean())

#### Question 3 - Is your proposed method from Question 2 appropriate in this case? Why or why not?

In [7]:
from scipy import stats

z = np.abs(stats.zscore(df_new[['February Average Temperature','February Average Temperature (Northeast)','February Average Temperature (Midwest)','February Average Temperature (Pennsylvania)','March Average Temperature','March Average Temperature (Northeast)',	'March Average Temperature (Midwest)',	'March Average Temperature (Pennsylvania)']]))
print(z)

[[0.00000000e+00 2.58915913e-15 3.04008467e-15 ... 3.80157210e-15
  3.27756800e-15 1.75654330e-15]
 [0.00000000e+00 2.58915913e-15 3.04008467e-15 ... 3.80157210e-15
  3.27756800e-15 1.75654330e-15]
 [0.00000000e+00 2.58915913e-15 3.04008467e-15 ... 3.80157210e-15
  3.27756800e-15 1.75654330e-15]
 ...
 [5.30163499e-01 4.11384351e-01 1.19676342e+00 ... 1.70352426e+00
  1.05375257e+00 1.38641068e+00]
 [2.57586666e-01 2.57344209e+00 1.98829310e+00 ... 1.22200292e+00
  2.23454527e-01 1.06503574e+00]
 [1.79624807e+00 1.31340328e+00 8.99720601e-01 ... 1.72062748e+00
  1.59858839e+00 1.85205987e+00]]

In [8]:
threshold = 3
print(np.where(z > 3))

(array([ 74, 126, 126]), array([6, 4, 6]))

The above 2 cells show that only 3 elements from the whole dataset have a z-score more than 3. So we don't have many outliers. Hence, choosing mean as a method of filling in missing values is appropriate.

#### Question 4 - Using the original dataframe (unchanged from Questoins 2, 3), create a mapping for the "Punxsutawney Phil" column which changes the categories into numerical quantities. For example: 'No Record' can be 0, 'No Shadow' can be 1, 'Partial Shadow' can be 2, and 'Full Shadow' can be 3. You should create the mapping *and* apply it to the data set by adding a new column called "Shadow".

In [0]:
def mapping(state):
    if state == 'No Record':
        return 0
    elif state == 'No Shadow':
        return 1
    elif state == 'Partial Shadow':
        return 2 
    elif state == 'Full Shadow':
        return 3

In [0]:
df['Shadow'] = df['Punxsutawney Phil']
df['Shadow'] = df.Shadow.apply(mapping)

In [11]:
df.head()

   Unnamed: 0  Year  ... March Average Temperature (Pennsylvania)  Shadow
0           0  1886  ...                                      NaN       0
1           1  1887  ...                                      NaN       3
2           2  1888  ...                                      NaN       3
3           3  1889  ...                                      NaN       0
4           4  1890  ...                                      NaN       1

[5 rows x 12 columns]

#### Question 5 - For all rows which have no record, remove the rows which have empty values in all of the quantitative columns. (Only 6 should be removed.)

In [0]:
arbitrary = df[df['Punxsutawney Phil'] == 'No Record'] 
arbitrary = arbitrary[arbitrary.isnull().any(axis=1)]

In [13]:
cond = df['Year'].isin(arbitrary['Year'])
df.drop(df[cond].index, inplace = True)
df.head()

    Unnamed: 0  Year  ... March Average Temperature (Pennsylvania)  Shadow
1            1  1887  ...                                      NaN       3
2            2  1888  ...                                      NaN       3
4            4  1890  ...                                      NaN       1
9            9  1895  ...                                     31.3       0
10          10  1896  ...                                     27.8       0

[5 rows x 12 columns]

#### Question 6 - For the remaining rows which have no record (but the other columns *are* populated), determine an appropriate method for inputting the value for this column. Explain your reasoning, and show your work below (using pandas).

In [0]:
df_no_record = df[(df['Shadow'] == 0)]
df_no_record = df_no_record.iloc[:, 3:11]
nrlist = df_no_record.mean().to_list()

df_no_shadow = df[(df['Shadow'] == 1)]
df_no_shadow = df_no_shadow.iloc[:, 3:11]
nslist = df_no_shadow.mean().to_list()

df_partial = df[(df['Shadow'] == 2)]
df_partial = df_partial.iloc[:, 3:11]
plist = df_partial.mean().to_list()

df_full = df[(df['Shadow'] == 3)]
df_full = df_full.iloc[:, 3:11]
flist = df_full.mean().to_list()

In [15]:
from statistics import mean
nsdiff = []
pdiff = []
fdiff = []
for i in range(7):
    nsdiff.append(nrlist[i] - nslist [i])
    pdiff.append(nrlist[i] - plist [i])
    fdiff.append(nrlist[i] - flist [i])
print (mean(nsdiff), mean(pdiff), mean(fdiff))

-3.6584285714285714 -1.6126190476190476 -2.709519047619047

In [1]:
 #the vast majority of shadows are full, so I made the remaining 3 full too since I failed to find any other correlation

From the above observations, partial shadow is the closest to the three rows with no records so it's better to replace no record with partial shadow.

In [0]:
df['Shadow'].replace(to_replace =0, value =2, inplace = True) 
df['Punxsutawney Phil'].replace(to_replace ="No Record", value ="Partial Shadow", inplace = True)

In [17]:
df.head()

    Unnamed: 0  Year  ... March Average Temperature (Pennsylvania)  Shadow
1            1  1887  ...                                      NaN       3
2            2  1888  ...                                      NaN       3
4            4  1890  ...                                      NaN       1
9            9  1895  ...                                     31.3       2
10          10  1896  ...                                     27.8       2

[5 rows x 12 columns]

#### Question 7 - If we are trying to write a machine learning program which predicts the type of shadow for the year, which column(s) should be the independent variables X? Why? 

#### Use pandas to assign a variable X to be all of the rows of the data set with the column(s) that represent the independent variables.

The First column is just an index column, it makes no addition to the target variable(which is the shadow for the year). <br>
The Year column adds no information to the shadow for that particular year so it can be neglected. <br> 
It can be inferred from the dataset that the Shadow for the year i.e. the 'Punxsutawney Phil' column is based off the average temperature i.e. all the columns containing the quantitative data. <br>
So all of these 8 columns will be our independent variables (X).

In [0]:
X = df.iloc[:, 3:11]

In [19]:
X

     February Average Temperature  ...  March Average Temperature (Pennsylvania)
1                             NaN  ...                                       NaN
2                             NaN  ...                                       NaN
4                             NaN  ...                                       NaN
9                           26.60  ...                                      31.3
10                          35.04  ...                                      27.8
..                            ...  ...                                       ...
126                         37.51  ...                                      47.7
127                         34.77  ...                                      33.9
128                         32.13  ...                                      30.3
129                         32.99  ...                                      31.6
130                         39.47  ...                                      43.4

[125 rows x 8 columns]

#### Question 8 - If we are trying to write a machine learning program which predicts the type of shadow for the year, which column(s) should be the dependent variables Y? Why?  

#### Use pandas to assign a variable Y to be all of the rows of the data set with the column(s) that represent the dependent variables.

A machine learning algorithm cannot diectly take in string values and that is why we have encoded the 'Punxsutawney Phil' column to the Shadow column at the end. Hence, the Shhadow column will be the target variable.

In [0]:
Y = df.iloc[:, df.columns == 'Shadow']

In [21]:
Y

     Shadow
1         3
2         3
4         1
9         2
10        2
..      ...
126       3
127       1
128       3
129       3
130       1

[125 rows x 1 columns]

#### Question 9 - Using the train_test_split function from the sklearn module, use a 70/30 split validation to split the data set into train and test. If you follow the example at the following link: https://scikit-learn.org/stable/modules/generated/sklearn.model_selection.train_test_split.html

Note: It's common practice to use the following variable names for unpacking the result:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=(YOUR VALUE))

sklearn will create a proper split where the following statements hold true:
X_train is your train set independent variables
Y_train is your train set dependent variables
X_test is your test set independent variables
Y_test is your test set dependent variables

In [0]:
from sklearn.model_selection import train_test_split

In [0]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.3)

#### Question 10 - Should the number of rows in X_train == number of rows in Y_train? Also, should the number of rows in X_test == Y_test? Why or why not? Validate your answer with code below:

A machine learning algorithm learns from the trainset(x_train and x_test) and measures its accuracy from the testset (y_train and y_test). Now if the number of rows of the independent variables(X_train and X_test) differ from the target variables, the algorithm won't be able to run properly i.e. it'll throw an error. So they should be the same on both the sides.

In [24]:
print (X_train.shape, Y_train.shape)
print (X_test.shape, Y_test.shape)

(87, 8) (87, 1)
(38, 8) (38, 1)